In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
seattle_file = "AirBnB Cities/Seattle/seattle.csv"

In [4]:
seattle_df = pd.read_csv(seattle_file)
seattle_df.head()

,listing_id,date,available,price,adjusted_price,minimum_nights,maximum_nights
0,493591,2019-02-09,f,$53.00,$53.00,2,180
1,493591,2019-02-10,f,$53.00,$53.00,2,180
2,493591,2019-02-11,t,$53.00,$53.00,2,180
3,493591,2019-02-12,t,$53.00,$53.00,2,180
4,493591,2019-02-13,t,$53.00,$53.00,2,180

In [6]:
len(seattle_df)

3087535

In [9]:
seattle_df.date.max()

'2020-02-08'

In [11]:
seattle_df.date.min()

'2019-02-09'

In [15]:
seattle_df.dtypes

listing_id         int64
date              object
available         object
price             object
adjusted_price    object
minimum_nights     int64
maximum_nights     int64
dtype: object

In [16]:
seattle_df['date'] = pd.to_datetime(seattle_df['date'])

In [17]:
seattle_df.dtypes

listing_id                 int64
date              datetime64[ns]
available                 object
price                     object
adjusted_price            object
minimum_nights             int64
maximum_nights             int64
dtype: object

In [18]:
seattle_df['YEAR'] = seattle_df['date'].dt.year
seattle_df['MONTH'] = seattle_df['date'].dt.month

In [19]:
seattle_df.head()

,listing_id,date,available,price,adjusted_price,minimum_nights,maximum_nights,YEAR,MONTH
0,493591,2019-02-09,f,$53.00,$53.00,2,180,2019,2
1,493591,2019-02-10,f,$53.00,$53.00,2,180,2019,2
2,493591,2019-02-11,t,$53.00,$53.00,2,180,2019,2
3,493591,2019-02-12,t,$53.00,$53.00,2,180,2019,2
4,493591,2019-02-13,t,$53.00,$53.00,2,180,2019,2